app/controllers/albums_controller.rb

  def create
    @album = Album.new(album_params)

    if @album.save
---
INSERT INTO "albums" ("title", "artist", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    @album = Album.find(params[:id])

    if @album.update(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "albums" SET "description" = ?, "updated_at" = ? WHERE "albums"."id" = ?  [["description", "Classic Beatles album. Coloration is blue."], ["updated_at", "2016-10-11 23:31:08.420477"], ["id", 2]]