app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "The Iliad"], ["author", "Homer"], ["description", "Classic Greek epic poem."], ["created_at", "2016-10-11 23:23:21.900389"], ["updated_at", "2016-10-11 23:23:21.900389"]]
---
  def create
    @book = Book.new(book_params)
    if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "books" SET "author" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["author", "Homer the Greek"], ["updated_at", "2016-10-11 23:23:48.644893"], ["id", 3]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)