app/controllers/movies_controller.rb

  def index
    @movies = Movie.order(upvotes: :desc)
---
SELECT "movies".* FROM "movies"  ORDER BY "movies"."upvotes" DESC

  def create
    @movie = Movie.new(movie_params)

    if @movie.save
---
INSERT INTO "movies" ("title", "director", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    @movie = Movie.find(params[:id])

    if @movie.update(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "description" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["description", "Movie about forest spirits. "], ["updated_at", "2016-10-11 23:13:13.793440"], ["id", 2]]

  def destroy
    movie = Movie.find(params[:id])
    movie.destroy
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 5]]